In [2]:
import pandas as pd

In [ ]:
#Product data cleaning

In [ ]:
product=pd.read_csv('Products.csv')

In [9]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [11]:
product['Product Name'].duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2512    False
2513    False
2514    False
2515    False
2516    False
Name: Product Name, Length: 2517, dtype: bool

In [12]:
product.describe()

        ProductKey  SubcategoryKey  CategoryKey
count  2517.000000     2517.000000  2517.000000
mean   1259.000000      491.810091     4.878824
std     726.739637      229.887134     2.299170
min       1.000000      101.000000     1.000000
25%     630.000000      305.000000     3.000000
50%    1259.000000      406.000000     4.000000
75%    1888.000000      801.000000     8.000000
max    2517.000000      808.000000     8.000000

In [19]:
product=product.drop(columns='Color',axis=1)

In [24]:
product['Unit Cost USD']=product['Unit Cost USD'].str.split('$').str[1]

In [26]:
product['Unit Price USD']=product['Unit Price USD'].str.split('$').str[1]

In [29]:
product

,ProductKey,Product Name,Brand,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,11.00,21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,1.71,3.35,505,Cell phones Accessories,5,Cell phones

In [32]:
product['Unit Cost USD']=product['Unit Cost USD'].str.replace(',','').str.strip()

In [33]:
product['Unit Price USD']=product['Unit Price USD'].str.replace(',','').str.strip()

In [36]:
product['Unit Cost USD']=product['Unit Cost USD'].astype('float')

In [37]:
product['Unit Price USD']=product['Unit Price USD'].astype('float')

In [41]:
product.to_excel('Product_excel.xlsx')

#Customers data cleaning

In [44]:
customers=pd.read_csv('Customers.csv',encoding='latin-1')

In [59]:
customers['State Code']=customers['State Code'].fillna('NA')

In [61]:
customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3/25/1936
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2/16/1992
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11/9/1937
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10/12/1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8/18/1965

In [64]:
customers['Birthday']=customers['Birthday'].str.replace('/','-',regex=False)

In [66]:
customers['Birthday']=customers['Birthday'].astype('datetime64[ns]')

In [73]:
customers.to_excel('Customers_excel.xlsx')

#Stores data cleaning

In [74]:
store=pd.read_csv('Stores.csv')

In [76]:
store=store.drop(66,axis=0)

In [82]:
store['Open Date']=store['Open Date'].str.replace('/','-',regex=False)

In [84]:
store['Open Date']=store['Open Date'].astype('datetime64[ns]')

In [87]:
store.to_excel('Store_excel.xlsx')

#Sales data cleaning

In [88]:
sales=pd.read_csv('Sales.csv')

In [91]:
sales['Order Date']=sales['Order Date'].str.replace('/','-',regex=False)

In [95]:
sales['Delivery Date']=sales['Delivery Date'].bfill()

In [97]:
sales['Delivery Date']=sales['Delivery Date'].str.replace('/','-',regex=False)

In [100]:
sales['Order Date']=sales['Order Date'].astype('datetime64[ns]')

In [102]:
sales['Delivery Date']=sales['Delivery Date'].astype('datetime64[ns]')

In [121]:
product[product['Product Name'].duplicated()]

Empty DataFrame
Columns: [ProductKey, Product Name, Brand, Unit Cost USD, Unit Price USD, SubcategoryKey, Subcategory, CategoryKey, Category]
Index: []

In [114]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   Delivery Date  62884 non-null  datetime64[ns]
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: datetime64[ns](2), int64(6), object(1)
memory usage: 4.3+ MB

In [104]:
sales.to_excel('Sales_excel.xlsx')

In [ ]:
#Exchange rate

In [7]:
df=pd.read_csv('C:/Users/ukesh/OneDrive/Desktop/Python/Exchange_Rates.csv')

In [12]:
df['Date']=df['Date'].astype('datetime64[ns]')

In [30]:
df

            Date Currency  Exchange
0     2015-01-01      USD    1.0000
1     2015-01-01      CAD    1.1583
2     2015-01-01      AUD    1.2214
3     2015-01-01      EUR    0.8237
4     2015-01-01      GBP    0.6415
...          ...      ...       ...
11210 2021-02-20      USD    1.0000
11211 2021-02-20      CAD    1.2610
11212 2021-02-20      AUD    1.2723
11213 2021-02-20      EUR    0.8238
11214 2021-02-20      GBP    0.7126

[11215 rows x 3 columns]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [20]:
df['Exchange']=df['Exchange'].astype('float')

In [22]:
df.to_excel('Exchange.xlsx')

In [ ]:
#Pushing Data

In [108]:
from sqlalchemy import create_engine
import pandas as pd

In [110]:
host='localhost'
port='5432'
database='jack'
user='postgres'
password='137700'

engine=create_engine(f"postgresql://{user}:{password}@{host}:{port}/{database}")
data=pd.read_excel('C:/Users/ukesh/OneDrive/Desktop/Python/bus_details/EDA/Final/Customers_excel.xlsx')
table='customers'
data.to_sql(table,engine,if_exists='replace',index=0)

266

In [111]:
host='localhost'
port='5432'
database='jack'
user='postgres'
password='137700'

engine=create_engine(f"postgresql://{user}:{password}@{host}:{port}/{database}")
data=pd.read_excel('C:/Users/ukesh/OneDrive/Desktop/Python/bus_details/EDA/Final/Product_excel.xlsx')
table='product'
data.to_sql(table,engine,if_exists='replace',index=0)

517

In [112]:
host='localhost'
port='5432'
database='jack'
user='postgres'
password='137700'

engine=create_engine(f"postgresql://{user}:{password}@{host}:{port}/{database}")
data=pd.read_excel('C:/Users/ukesh/OneDrive/Desktop/Python/bus_details/EDA/Final/Sales_excel.xlsx')
table='sales'
data.to_sql(table,engine,if_exists='replace',index=0)

884

In [113]:
host='localhost'
port='5432'
database='jack'
user='postgres'
password='137700'

engine=create_engine(f"postgresql://{user}:{password}@{host}:{port}/{database}")
data=pd.read_excel('C:/Users/ukesh/OneDrive/Desktop/Python/bus_details/EDA/Final/Store_excel.xlsx')
table='store'
data.to_sql(table,engine,if_exists='replace',index=0)

66

In [35]:
import psycopg2 as pg
con=pg.connect(
    host='localhost',
    port='5432',
    database='jack',
    user='postgres',
    password='137700'
)
cursor=con.cursor()
cursor.execute('''create table exchange(date timestamp,currency varchar(5),exchange float)''')
data=list(zip(df['Date'],df['Currency'],df['Exchange']))
insert=('''insert into exchange(date,currency,exchange) values(%s,%s,%s)''')
cursor.executemany(insert,data)
con.commit()
con.close()